Revit 2027 API
SunAndShadowSettings.GetFrameAltitude Method
 Identifies the altitude of the sun (angle in radians) for a specific frame.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetFrameAltitude(
	double frame
)
Public Function GetFrameAltitude (
	frame As Double
) As Double
public:
double GetFrameAltitude(
	double frame
)
member GetFrameAltitude :
        frame : float -> float
Parameters
frame Double
 Frame for which time is requested
Return Value
Double
 Altitude angle (radians)
Exceptions
Exception | Condition
ArgumentException |  the frame value frame is not valid.
See Also
Reference
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace